# -*- coding: utf-8 -*-
"""
Created on Tue Apr 25 14:36:49 2023

@author: Marko
"""

# За замовчуванням plot() функція малює лінію від точки 
# до точки. Функція приймає параметри для вказівки точок.
# Параметр 1 - це масив, що містить точки на осі Х.
# Параметр 2 - це масив, що містить точки на осі Y.
# Якщо вам потрібно побудувати лінію від (1,3) до (8,10),
# ми повинні передати два масиви [1,8] i [3,10] у функцію
# plot
import matplotlib.pyplot as plt
import numpy as np

xpoints = np.array([1,8])
ypoints = np.array([3,10])

plt.plot(xpoints, ypoints)
plt.show()

# щоб відобразились лише маркери, ви можете використати
# параметр нотації рядка швидкого доступу "о", що означає
# кільця. Намалюйе дві точки на діаграмі, одну в позиції
# (1,3) і одну в позиції (8,10)
xpoints = np.array([1,8])
ypoints = np.array([3,10])

plt.plot(xpoints, ypoints, 'o')
plt.show()

# ви можете нанести скільки завгодно точок, просто 
# переконайтесь, що кількість точок на обох осях однакова.
# Проведіть лінію на схемі від позиції (1,3) до (2,8), 
# потім до (6,1) і, нарешті, до позиції (8,10)
xpoints = np.array([1,2,6,8])
ypoints = np.array([3,8,1,10])
plt.plot(xpoints, ypoints)
plt.show()
# якщо ми не вказуємо точки на осі X, вони отримають 
# значення за замовчуванням 0,1,2,3,4(і т.д., залежно від
# довжини точок y). Отже, якщо ми візьмемо той самий приклад,
# що й вище, і залишимо точки у, діаграма виглядатиме так:
ypoints = np.array([3,8,1,10,5,7])
plt.plot(ypoints)
plt.show()